package common

var CODE2NAME map[string]string = map[string]string{
	"4303": "湘潭市", "4302": "株洲市", "4301": "长沙市", "1307": "张家口市", "4307": "常德市", "4306": "岳阳市", "4305": "邵阳市", "4304": "衡阳市",
	"2305": "双鸭山市", "4309": "益阳市", "4308": "张家界市", "1308": "承德市", "1306": "保定市", "4506": "防城港市", "2304": "鹤岗市", "3416": "亳州市",
	"3417": "池州市", "3415": "六安市", "4228": "恩施土家族苗族自治州", "3413": "宿州市", "3410": "黄山市", "3411": "滁州市", "3711": "日照市",
	"6229": "临夏回族自治州", "3418": "宣城市", "1301": "石家庄市", "2224": "延边朝鲜族自治州", "3717": "菏泽市", "3714": "德州市", "1302": "唐山市",
	"4105": "安阳市", "3208": "淮安市", "4602": "三亚市", "1303": "秦皇岛市", "5107": "绵阳市", "6327": "玉树藏族自治州", "6326": "果洛藏族自治州",
	"6325": "海南藏族自治州", "6323": "黄南藏族自治州", "6322": "海北藏族自治州", "5105": "泸州市", "6328": "海西蒙古族藏族自治州", "3716": "滨州市",
	"3207": "连云港市", "1311": "衡水市", "1310": "廊坊市", "4207": "鄂州市", "1309": "沧州市", "3401": "合肥市", "3403": "蚌埠市", "3402": "芜湖市",
	"3405": "马鞍山市", "3404": "淮南市", "3407": "铜陵市", "3406": "淮北市", "3408": "安庆市", "3509": "宁德市", "5308": "普洱市", "5309": "临沧市",
	"4107": "新乡市", "2205": "通化市", "4408": "湛江市", "4409": "茂名市", "4404": "珠海市", "5301": "昆明市", "4406": "佛山市", "5303": "曲靖市",
	"2312": "绥化市", "5305": "保山市", "2310": "牡丹江市", "2311": "黑河市", "5223": "黔西南布依族苗族自治州", "6405": "中卫市", "4405": "汕头市",
	"1410": "临汾市", "1411": "吕梁市", "1404": "长治市", "3710": "威海市", "4104": "平顶山市", "4313": "娄底市", "4407": "江门市", "4414": "梅州市",
	"5304": "玉溪市", "4202": "黄石市", "4106": "鹤壁市", "4401": "广州市", "4208": "荆门市", "4209": "孝感市", "5306": "昭通市", "1304": "邯郸市",
	"3309": "舟山市", "3306": "绍兴市", "3307": "金华市", "3304": "嘉兴市", "5307": "丽江市", "3302": "宁波市", "3303": "温州市", "4205": "宜昌市",
	"2309": "七台河市", "2308": "佳木斯市", "3308": "衢州市", "3704": "枣庄市", "4419": "东莞市", "4418": "清远市", "2301": "哈尔滨市", "4416": "河源市",
	"4415": "汕尾市", "2302": "齐齐哈尔市", "4413": "惠州市", "4412": "肇庆市", "2307": "伊春市", "2306": "大庆市", "1525": "锡林郭勒盟", "1409": "忻州市",
	"1408": "运城市", "1305": "邢台市", "1522": "兴安盟", "1403": "阳泉市", "1402": "大同市", "1401": "太原市", "1407": "晋中市", "1406": "朔州市",
	"1405": "晋城市", "6302": "海东市", "4211": "黄冈市", "4210": "荆州市", "4213": "随州市", "4212": "咸宁市", "3713": "临沂市", "4417": "阳江市",
	"4116": "周口市", "4117": "驻马店市", "4114": "商丘市", "4115": "信阳市", "4112": "三门峡市", "5323": "楚雄彝族自治州", "4110": "许昌市", "4111": "漯河市",
	"3311": "丽水市", "2327": "大兴安岭地区", "3310": "台州市", "5120": "资阳市", "6104": "咸阳市", "5328": "西双版纳傣族自治州", "5329": "大理白族自治州",
	"3508": "龙岩市", "5326": "文山壮族苗族自治州", "2206": "白山市", "5401": "拉萨市", "6502": "克拉玛依市", "6501": "乌鲁木齐市", "3503": "莆田市",
	"3504": "三明市", "3505": "泉州市", "3506": "漳州市", "3507": "南平市", "5325": "红河哈尼族彝族自治州", "4501": "南宁市", "5423": "日喀则地区",
	"4113": "南阳市", "3610": "抚州市", "3611": "上饶市", "6301": "西宁市", "3201": "南京市", "4502": "柳州市", "4514": "崇左市", "5331": "德宏傣族景颇族自治州",
	"4513": "来宾市", "5333": "怒江傈僳族自治州", "4102": "开封市", "6532": "和田地区", "5334": "迪庆藏族自治州", "6530": "克孜勒苏柯尔克孜自治州",
	"6531": "喀什地区", "4109": "濮阳市", "4108": "焦作市", "2114": "葫芦岛市", "5134": "凉山彝族自治州", "5133": "甘孜藏族自治州", "5132": "阿坝藏族羌族自治州",
	"3204": "常州市", "2201": "长春市", "2202": "吉林市", "2203": "四平市", "3210": "扬州市", "3211": "镇江市", "3212": "泰州市", "2207": "松原市",
	"2208": "白城市", "4509": "玉林市", "3412": "阜阳市", "4508": "贵港市", "1502": "包头市", "1503": "乌海市", "6206": "武威市", "6207": "张掖市",
	"1506": "鄂尔多斯市", "6201": "兰州市", "6202": "嘉峪关市", "6203": "金昌市", "2110": "辽阳市", "2111": "盘锦市", "2112": "铁岭市", "1509": "乌兰察布市",
	"6208": "平凉市", "6209": "酒泉市", "1507": "呼伦贝尔市", "3603": "萍乡市", "3602": "景德镇市", "3601": "南昌市", "3607": "赣州市", "1504": "赤峰市",
	"3605": "新余市", "3604": "九江市", "5119": "巴中市", "3609": "宜春市", "1505": "通辽市", "4402": "韶关市", "6521": "吐鲁番地区", "2106": "丹东市",
	"5108": "广元市", "5109": "遂宁市", "6527": "博尔塔拉蒙古自治州", "6529": "阿克苏地区", "5103": "自贡市", "5421": "昌都地区", "5101": "成都市",
	"5106": "德阳市", "1508": "巴彦淖尔市", "5104": "攀枝花市", "4601": "海口市", "6402": "石嘴山市", "6403": "吴忠市", "3205": "苏州市", "2113": "朝阳市",
	"3203": "徐州市", "3202": "无锡市", "6404": "固原市", "2204": "辽源市", "5425": "阿里地区", "5424": "那曲地区", "4403": "深圳市", "6110": "商洛市",
	"5226": "黔东南苗族侗族自治州", "3209": "盐城市", "5422": "山南地区", "2109": "阜新市", "2108": "营口市", "6212": "陇南市", "6211": "定西市",
	"3501": "福州市", "2103": "鞍山市", "2102": "大连市", "2101": "沈阳市", "2107": "锦州市", "3502": "厦门市", "2105": "本溪市", "2104": "抚顺市",
	"5115": "宜宾市", "5114": "眉山市", "5117": "达州市", "5116": "广安市", "5111": "乐山市", "5110": "内江市", "5113": "南充市", "5426": "林芝地区",
	"5227": "黔南布依族苗族自治州", "5118": "雅安市", "4453": "云浮市", "4452": "揭阳市", "4451": "潮州市", "4203": "十堰市", "3213": "宿迁市", "3606": "鹰潭市",
	"6210": "庆阳市", "6105": "渭南市", "4201": "武汉市", "6109": "安康市", "6108": "榆林市", "4512": "河池市", "4206": "襄阳市", "4510": "百色市",
	"4511": "贺州市", "6103": "宝鸡市", "6102": "铜川市", "4101": "郑州市", "6204": "白银市", "4505": "北海市", "3701": "济南市", "3712": "莱芜市",
	"3301": "杭州市", "5203": "遵义市", "4310": "郴州市", "4311": "永州市", "4312": "怀化市", "3608": "吉安市", "6205": "天水市", "5201": "贵阳市",
	"4504": "梧州市", "3708": "济宁市", "3709": "泰安市", "5205": "毕节市", "5204": "安顺市", "4503": "桂林市", "5206": "铜仁市", "3702": "青岛市",
	"1501": "呼和浩特市", "4603": "三沙市", "4331": "湘西土家族苗族自治州", "3706": "烟台市", "3707": "潍坊市", "6528": "巴音郭楞蒙古自治州", "3705": "东营市",
	"1529": "阿拉善盟", "3305": "湖州市", "6543": "阿勒泰地区", "6542": "塔城地区", "3715": "聊城市", "6540": "伊犁哈萨克自治州", "4103": "洛阳市",
	"5202": "六盘水市", "6523": "昌吉回族自治州", "6230": "甘南藏族自治州", "4507": "钦州市", "6107": "汉中市", "6522": "哈密地区", "3206": "南通市",
	"6106": "延安市", "4420": "中山市", "6101": "西安市", "6401": "银川市", "2303": "鸡西市", "3703": "淄博市", "8200": "澳门特别行政区",
	"8100": "香港特别行政区", "7100": "台湾"}

var MDCG_CITY map[string]string = map[string]string{"11": "北京市", "12": "天津市", "31": "上海市", "50": "重庆市"} //4190：济源市

var OTHER_CITY map[string]string = map[string]string{
	"419001": "济源市", "659001": "石河子市", "659002": "阿拉尔市", "659003": "图木舒克市", "659004": "五家渠市", "659005": "北屯市",
	"659006": "铁门关市", "659007": "双河市", "659008": "可克达拉市", "429004": "仙桃市", "429005": "潜江市", "429006": "天门市",
	"429021": "神农架林区", "469001": "五指山市", "469002": "琼海市", "469003": "儋州市", "469005": "文昌市", "469006": "万宁市",
	"469007": "东方市", "469021": "定安县", "469022": "屯昌县", "469023": "澄迈县", "469024": "临高县", "469025": "白沙黎族自治县",
	"469026": "昌江黎族自治县", "469027": "乐东黎族自治县", "469028": "陵水黎族自治县", "469029": "保亭黎族苗族自治县",
	"469030": "琼中黎族苗族自治县"}

func GetCityFromCode(code string) string {
	//六位城市编码
	//根据前四位编码返回城市名
	if len(code) == 6 {
		if _, ok := CODE2NAME[code[:4]]; ok {
			return CODE2NAME[code[:4]]
		} else {
			if _, ok := MDCG_CITY[code[:2]]; ok {
				return MDCG_CITY[code[:2]]
			} else if _, ok := OTHER_CITY[code]; ok {
				return OTHER_CITY[code]
			}

		}
	}
	return ""
}
